app/Controllers/Auth.php

    public function login()
    {
        helper(['form']);
        $data = [];

        if ($this->request->is('post')) {
            $rules = [
                'email'    => 'required|valid_email',
                'password' => 'required|min_length[6]|max_length[255]'
            ];

            $validationMessages = [
                'email' => [
                    'required' => 'Email is required.',
                    'valid_email' => 'Please enter a valid email address.'
                ],
                'password' => [
                    'required' => 'Password is required.',
                    'min_length' => 'Password must be at least 6 characters long.'
                ]
            ];

            if ($this->validate($rules, $validationMessages)) {
                $email = trim($this->request->getPost('email'));
                $password = $this->request->getPost('password');

                try {
                    $user = $this->users->where('email', $email)->get()->getRow();
---
SELECT *
FROM `users`
WHERE `email` = 'Admin123!@gmail.com'

    private function getAdminDashboardData()
    {
        return [
            'title' => "Admin Dashboard",
            'description' => "Manage system, users, and courses",
            'total_users' => $this->users->countAll(),
            'total_students' => $this->users->where('role', 'student')->countAllResults(false),
            'total_teachers' => $this->users->where('role', 'teacher')->countAllResults(false),
            'total_admins' => $this->users->where('role', 'admin')->countAllResults(false),
            'recent_users' => $this->users
                ->select('id, name, email, role, status, created_at')
                ->orderBy('id', 'DESC')
                ->limit(5)
                ->get()
                ->getResultArray()
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
AND `role` = 'teacher'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
AND `role` = 'teacher'
AND `role` = 'admin'
SELECT `id`, `name`, `email`, `role`, `status`, `created_at`
FROM `users`
WHERE `role` = 'student'
AND `role` = 'teacher'
AND `role` = 'admin'
ORDER BY `id` DESC
 LIMIT 5